app/views/entries/index.html.erb

                    </li>
                    <li class="journal-name"><%= link_to "Journal: #{Journal.find(params[:journal_id]).name}", user_journals_path(@user) %></li>
---
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = 1 AND "journals"."id" = ? LIMIT 1  [["id", "1"]]