app/controllers/entries_controller.rb

  def create
    @entry = @entries.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("body", "created_at", "journal_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sadfsdf"], ["created_at", Thu, 31 Jan 2013 16:19:31 UTC +00:00], ["journal_id", nil], ["title", "test"], ["updated_at", Thu, 31 Jan 2013 16:19:31 UTC +00:00]]

  def update
    @entry = @entries.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
UPDATE "entries" SET "body" = 'Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!Today I woke up.... !!!!!!!!!!!!!!!!!!!', "updated_at" = '2013-01-31 16:27:14.171427' WHERE "entries"."id" = 12

  def destroy
    @entry = @entries.find(params[:id])
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 3]]