app/controllers/journals_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."journal_id" = 1
---
  def show

    @journal = @journals.find(params[:id])

    @entries = @journal.entries.all

SELECT "journals".* FROM "journals" WHERE "journals"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @journal = Journal.find(params[:id])

INSERT INTO "journals" ("created_at", "description", "name", "private", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @journal = @journals.new(params[:journal])

    respond_to do |format|
      if @journal.save

DELETE FROM "journals" WHERE "journals"."id" = ?  [["id", 3]]
---
  def destroy
    @journal = @journals.find(params[:id])
    @journal.destroy